HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPsi5_regdef.h
/** \\brief  NFIOV Clear Register */
typedef struct _Ifx_PSI5_NFICLR_Bits
{
    unsigned int NFI0:1;                    /**< \brief [0:0] Clear NFI Flag of Buffer 0 (w) */
    unsigned int NFI1:1;                    /**< \brief [1:1] Clear NFI Flag of Buffer 1 (w) */
    unsigned int NFI2:1;                    /**< \brief [2:2] Clear NFI Flag of Buffer 2 (w) */
    unsigned int NFI3:1;                    /**< \brief [3:3] Clear NFI Flag of Buffer 3 (w) */
    unsigned int NFI4:1;                    /**< \brief [4:4] Clear NFI Flag of Buffer 4 (w) */
    unsigned int NFI5:1;                    /**< \brief [5:5] Clear NFI Flag of Buffer 5 (w) */
    unsigned int NFI6:1;                    /**< \brief [6:6] Clear NFI Flag of Buffer 6 (w) */
    unsigned int NFI7:1;                    /**< \brief [7:7] Clear NFI Flag of Buffer 7 (w) */
    unsigned int NFI8:1;                    /**< \brief [8:8] Clear NFI Flag of Buffer 8 (w) */
    unsigned int NFI9:1;                    /**< \brief [9:9] Clear NFI Flag of Buffer 9 (w) */
    unsigned int NFI10:1;                   /**< \brief [10:10] Clear NFI Flag of Buffer 10 (w) */
    unsigned int NFI11:1;                   /**< \brief [11:11] Clear NFI Flag of Buffer 11 (w) */
    unsigned int NFI12:1;                   /**< \brief [12:12] Clear NFI Flag of Buffer 12 (w) */
    unsigned int NFI13:1;                   /**< \brief [13:13] Clear NFI Flag of Buffer 13 (w) */
    unsigned int NFI14:1;                   /**< \brief [14:14] Clear NFI Flag of Buffer 14 (w) */
    unsigned int NFI15:1;                   /**< \brief [15:15] Clear NFI Flag of Buffer 15 (w) */
    unsigned int NFI16:1;                   /**< \brief [16:16] Clear NFI Flag of Buffer 16 (w) */
    unsigned int NFI17:1;                   /**< \brief [17:17] Clear NFI Flag of Buffer 17 (w) */
    unsigned int NFI18:1;                   /**< \brief [18:18] Clear NFI Flag of Buffer 18 (w) */
    unsigned int NFI19:1;                   /**< \brief [19:19] Clear NFI Flag of Buffer 19 (w) */
    unsigned int NFI20:1;                   /**< \brief [20:20] Clear NFI Flag of Buffer 20 (w) */
    unsigned int NFI21:1;                   /**< \brief [21:21] Clear NFI Flag of Buffer 21 (w) */
    unsigned int NFI22:1;                   /**< \brief [22:22] Clear NFI Flag of Buffer 22 (w) */
    unsigned int NFI23:1;                   /**< \brief [23:23] Clear NFI Flag of Buffer 23 (w) */
    unsigned int NFI24:1;                   /**< \brief [24:24] Clear NFI Flag of Buffer 24 (w) */
    unsigned int NFI25:1;                   /**< \brief [25:25] Clear NFI Flag of Buffer 25 (w) */
    unsigned int NFI26:1;                   /**< \brief [26:26] Clear NFI Flag of Buffer 26 (w) */
    unsigned int NFI27:1;                   /**< \brief [27:27] Clear NFI Flag of Buffer 27 (w) */
    unsigned int NFI28:1;                   /**< \brief [28:28] Clear NFI Flag of Buffer 28 (w) */
    unsigned int NFI29:1;                   /**< \brief [29:29] Clear NFI Flag of Buffer 29 (w) */
    unsigned int NFI30:1;                   /**< \brief [30:30] Clear NFI Flag of Buffer 30 (w) */
    unsigned int NFI31:1;                   /**< \brief [31:31] Clear NFI Flag of Buffer 31 (w) */
} Ifx_PSI5_NFICLR_Bits;

/** \\brief  NFI Overview Register */
typedef struct _Ifx_PSI5_NFIOV_Bits
{
    unsigned int NFI0:1;                    /**< \brief [0:0] NFI Flag of Buffer 0 (rh) */
    unsigned int NFI1:1;                    /**< \brief [1:1] NFI Flag of Buffer 1 (rh) */
    unsigned int NFI2:1;                    /**< \brief [2:2] NFI Flag of Buffer 2 (rh) */
    unsigned int NFI3:1;                    /**< \brief [3:3] NFI Flag of Buffer 3 (rh) */
    unsigned int NFI4:1;                    /**< \brief [4:4] NFI Flag of Buffer 4 (rh) */
    unsigned int NFI5:1;                    /**< \brief [5:5] NFI Flag of Buffer 5 (rh) */
    unsigned int NFI6:1;                    /**< \brief [6:6] NFI Flag of Buffer 6 (rh) */
    unsigned int NFI7:1;                    /**< \brief [7:7] NFI Flag of Buffer 7 (rh) */
    unsigned int NFI8:1;                    /**< \brief [8:8] NFI Flag of Buffer 8 (rh) */
    unsigned int NFI9:1;                    /**< \brief [9:9] NFI Flag of Buffer 9 (rh) */
    unsigned int NFI10:1;                   /**< \brief [10:10] NFI Flag of Buffer 10 (rh) */
    unsigned int NFI11:1;                   /**< \brief [11:11] NFI Flag of Buffer 11 (rh) */
    unsigned int NFI12:1;                   /**< \brief [12:12] NFI Flag of Buffer 12 (rh) */
    unsigned int NFI13:1;                   /**< \brief [13:13] NFI Flag of Buffer 13 (rh) */
    unsigned int NFI14:1;                   /**< \brief [14:14] NFI Flag of Buffer 14 (rh) */
    unsigned int NFI15:1;                   /**< \brief [15:15] NFI Flag of Buffer 15 (rh) */
    unsigned int NFI16:1;                   /**< \brief [16:16] NFI Flag of Buffer 16 (rh) */
    unsigned int NFI17:1;                   /**< \brief [17:17] NFI Flag of Buffer 17 (rh) */
    unsigned int NFI18:1;                   /**< \brief [18:18] NFI Flag of Buffer 18 (rh) */
    unsigned int NFI19:1;                   /**< \brief [19:19] NFI Flag of Buffer 19 (rh) */
    unsigned int NFI20:1;                   /**< \brief [20:20] NFI Flag of Buffer 20 (rh) */
    unsigned int NFI21:1;                   /**< \brief [21:21] NFI Flag of Buffer 21 (rh) */
    unsigned int NFI22:1;                   /**< \brief [22:22] NFI Flag of Buffer 22 (rh) */
    unsigned int NFI23:1;                   /**< \brief [23:23] NFI Flag of Buffer 23 (rh) */
    unsigned int NFI24:1;                   /**< \brief [24:24] NFI Flag of Buffer 24 (rh) */
    unsigned int NFI25:1;                   /**< \brief [25:25] NFI Flag of Buffer 25 (rh) */
    unsigned int NFI26:1;                   /**< \brief [26:26] NFI Flag of Buffer 26 (rh) */
    unsigned int NFI27:1;                   /**< \brief [27:27] NFI Flag of Buffer 27 (rh) */
    unsigned int NFI28:1;                   /**< \brief [28:28] NFI Flag of Buffer 28 (rh) */
    unsigned int NFI29:1;                   /**< \brief [29:29] NFI Flag of Buffer 29 (rh) */
    unsigned int NFI30:1;                   /**< \brief [30:30] NFI Flag of Buffer 30 (rh) */
    unsigned int NFI31:1;                   /**< \brief [31:31] NFI Flag of Buffer 31 (rh) */
} Ifx_PSI5_NFIOV_Bits;

/** \\brief  NFIOV Set Register */
typedef struct _Ifx_PSI5_NFISET_Bits
{
    unsigned int NFI0:1;                    /**< \brief [0:0] Set NFI Flag of Buffer 0 (w) */
    unsigned int NFI1:1;                    /**< \brief [1:1] Set NFI Flag of Buffer 1 (w) */
    unsigned int NFI2:1;                    /**< \brief [2:2] Set NFI Flag of Buffer 2 (w) */
    unsigned int NFI3:1;                    /**< \brief [3:3] Set NFI Flag of Buffer 3 (w) */
    unsigned int NFI4:1;                    /**< \brief [4:4] Set NFI Flag of Buffer 4 (w) */
    unsigned int NFI5:1;                    /**< \brief [5:5] Set NFI Flag of Buffer 5 (w) */
    unsigned int NFI6:1;                    /**< \brief [6:6] Set NFI Flag of Buffer 6 (w) */
    unsigned int NFI7:1;                    /**< \brief [7:7] Set NFI Flag of Buffer 7 (w) */
    unsigned int NFI8:1;                    /**< \brief [8:8] Set NFI Flag of Buffer 8 (w) */
    unsigned int NFI9:1;                    /**< \brief [9:9] Set NFI Flag of Buffer 9 (w) */
    unsigned int NFI10:1;                   /**< \brief [10:10] Set NFI Flag of Buffer 10 (w) */
    unsigned int NFI11:1;                   /**< \brief [11:11] Set NFI Flag of Buffer 11 (w) */
    unsigned int NFI12:1;                   /**< \brief [12:12] Set NFI Flag of Buffer 12 (w) */
    unsigned int NFI13:1;                   /**< \brief [13:13] Set NFI Flag of Buffer 13 (w) */
    unsigned int NFI14:1;                   /**< \brief [14:14] Set NFI Flag of Buffer 14 (w) */
    unsigned int NFI15:1;                   /**< \brief [15:15] Set NFI Flag of Buffer 15 (w) */
    unsigned int NFI16:1;                   /**< \brief [16:16] Set NFI Flag of Buffer 16 (w) */
    unsigned int NFI17:1;                   /**< \brief [17:17] Set NFI Flag of Buffer 17 (w) */
    unsigned int NFI18:1;                   /**< \brief [18:18] Set NFI Flag of Buffer 18 (w) */
    unsigned int NFI19:1;                   /**< \brief [19:19] Set NFI Flag of Buffer 19 (w) */
    unsigned int NFI20:1;                   /**< \brief [20:20] Set NFI Flag of Buffer 20 (w) */
    unsigned int NFI21:1;                   /**< \brief [21:21] Set NFI Flag of Buffer 21 (w) */
    unsigned int NFI22:1;                   /**< \brief [22:22] Set NFI Flag of Buffer 22 (w) */
    unsigned int NFI23:1;                   /**< \brief [23:23] Set NFI Flag of Buffer 23 (w) */
    unsigned int NFI24:1;                   /**< \brief [24:24] Set NFI Flag of Buffer 24 (w) */
    unsigned int NFI25:1;                   /**< \brief [25:25] Set NFI Flag of Buffer 25 (w) */
    unsigned int NFI26:1;                   /**< \brief [26:26] Set NFI Flag of Buffer 26 (w) */
    unsigned int NFI27:1;                   /**< \brief [27:27] Set NFI Flag of Buffer 27 (w) */
    unsigned int NFI28:1;                   /**< \brief [28:28] Set NFI Flag of Buffer 28 (w) */
    unsigned int NFI29:1;                   /**< \brief [29:29] Set NFI Flag of Buffer 29 (w) */
    unsigned int NFI30:1;                   /**< \brief [30:30] Set NFI Flag of Buffer 30 (w) */
    unsigned int NFI31:1;                   /**< \brief [31:31] Set NFI Flag of Buffer 31 (w) */
} Ifx_PSI5_NFISET_Bits;

