HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPsi5_regdef.h
/** \\brief  Fractional Divider Register for Lower Bit Rate */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_FDRL_Bits B;
} Ifx_PSI5_FDRL;

/** \\brief  Fractional Divider Register for Time Stamp */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_FDRT_Bits B;
} Ifx_PSI5_FDRT;

/** \\brief  Global Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_GCR_Bits B;
} Ifx_PSI5_GCR;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_ID_Bits B;
} Ifx_PSI5_ID;

/** \\brief  Interrupt Node Pointer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_INP_Bits B;
} Ifx_PSI5_INP;

/** \\brief  Interrupt Clear Register A */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_INTCLRA_Bits B;
} Ifx_PSI5_INTCLRA;

/** \\brief  Interrupt Clear Register A */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_INTCLRB_Bits B;
} Ifx_PSI5_INTCLRB;

/** \\brief  Interrupt Enable Register A */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_INTENA_Bits B;
} Ifx_PSI5_INTENA;

/** \\brief  Interrupt Enable Register B */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_INTENB_Bits B;
} Ifx_PSI5_INTENB;

/** \\brief  Interrupt Overview Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_INTOV_Bits B;
} Ifx_PSI5_INTOV;

/** \\brief  Interrupt Set Register A */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_INTSETA_Bits B;
} Ifx_PSI5_INTSETA;

/** \\brief  Interrupt Set Register B */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_INTSETB_Bits B;
} Ifx_PSI5_INTSETB;

/** \\brief  Interrupt Status Register A */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_INTSTATA_Bits B;
} Ifx_PSI5_INTSTATA;

/** \\brief  Interrupt Status Register B */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_INTSTATB_Bits B;
} Ifx_PSI5_INTSTATB;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_KRST0_Bits B;
} Ifx_PSI5_KRST0;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_KRST1_Bits B;
} Ifx_PSI5_KRST1;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_KRSTCLR_Bits B;
} Ifx_PSI5_KRSTCLR;

/** \\brief  MEIOV Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_MEICLR_Bits B;
} Ifx_PSI5_MEICLR;

/** \\brief  MEI Overview Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_MEIOV_Bits B;
} Ifx_PSI5_MEIOV;

/** \\brief  MEIOV Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_MEISET_Bits B;
} Ifx_PSI5_MEISET;

/** \\brief  NBIOV Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_NBICLR_Bits B;
} Ifx_PSI5_NBICLR;

/** \\brief  NBI Overview Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_NBIOV_Bits B;
} Ifx_PSI5_NBIOV;

/** \\brief  NBIOV Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_NBISET_Bits B;
} Ifx_PSI5_NBISET;

/** \\brief  NFIOV Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_NFICLR_Bits B;
} Ifx_PSI5_NFICLR;

/** \\brief  NFI Overview Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_NFIOV_Bits B;
} Ifx_PSI5_NFIOV;

/** \\brief  NFIOV Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_NFISET_Bits B;
} Ifx_PSI5_NFISET;

